# 백준 2447 별찍기-10


N = int(input())

Map = [[0 for i in range(N)] for i in range(N)]


def draw_star(n):

    global Map

    if n == 3:
        Map[0][:3] = Map[2][:3] = [1]*3
        Map[1][:3] = [1,0,1]
        return

    #3x3으로 통제할거여서 크기에 따라 복제할 사이즈가 달라지니까 
    a = n//3
    draw_star(n//3)

    # 큰 3x3격자
    for i in range(3):
        for j in range(3): 
            #복제할때 중간에는 비워져야함
            if i == 1 and j == 1:
                continue
            for k in range(a):
                Map[a*i+k][a*j:a*(j+1)] = Map[k][:a]  #핵심아이디어


draw_star(N)


# 1을 *로 0을 빈칸으로 그리기
for i in Map:
    for j in i:
        if j:
            print('*', end='')
        else:
            print(' ', end='')
    print()






# 규칙 : 무조건 9개로 생각하고 가운데 비어져있고, 9개중 하는 3^(i-1)일때이다.
# 밑에는 n이 9라고 생각하고 for 들어가기 전에 재귀만 탄거고 그 젤 밑에는 for로 작은거 가운데 빼고 복사하는 코드


# [1, 1, 1, 0, 0, 0, 0, 0, 0]
# [1, 0, 1, 0, 0, 0, 0, 0, 0]
# [1, 1, 1, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 0, 0, 0, 0, 0, 0]
# [0, 0, 0, 0, 0, 0, 0, 0, 0]



# [1, 1, 1, 1, 1, 1, 1, 1, 1]
# [1, 0, 1, 1, 0, 1, 1, 0, 1]
# [1, 1, 1, 1, 1, 1, 1, 1, 1]
# [1, 1, 1, 0, 0, 0, 1, 1, 1]
# [1, 0, 1, 0, 0, 0, 1, 0, 1]
# [1, 1, 1, 0, 0, 0, 1, 1, 1]
# [1, 1, 1, 1, 1, 1, 1, 1, 1]
# [1, 0, 1, 1, 0, 1, 1, 0, 1]
# [1, 1, 1, 1, 1, 1, 1, 1, 1]





